#define _CRT_SECURE_NO_WARNINGS 
#include<stdio.h>
//运算符

//int main()
//{   //算数运算符
//	//int a=9/2;//等号右边都是整形，值也为整形，为除出来的商
//	//float b=9/2.0;//等号右边有一个小数，也就是浮点型，结果也为浮点型
//	int a = 9 % 2; //%为取余(模)
//	printf("%d\n", a);
//	return 0;
//}
//int main()
//{    //移操作符
//	int a = 2;  //所以先换算成2进制位再移动
//	int b = a << 1;//左移运算符，左移一位，移的是二进制位
//	printf("%d\n", b);
//	return 0;
//}

//位操作符
// & ^ |

//逻辑反运算符 !表示真假的 ，在C语言中非零为真，0为假
//int main()
//{
//	int a = 0;
//
//	printf("%d\n", !a);
//	return 0;
// }
   
//单目运算符
//int main()
//{
//	//sizeof是一个操作符，计算类型或者变量大小，计算的是类型的大小，单位是字节，比如int占4个字节
//	int a = 10;
//	printf("%d\n", sizeof(int)); //后面是类型的话，括号不能省略
//	printf("%d\n", sizeof(a));  //sizeof后面的括号能省略，说明sizeof不是一个函数，是一个操作符，函数后面的操作符不能省略
//
//	return 0;
// }

//int main()
//{
//	int a = 0;
//	printf("%d\n",~a );//结果是-1
//	// ~按位取反，把所有2进制位中的数字，1变成0，0变成1，按位取反包括所有位，符号位也算
//	
//	//整数在内存中存储的是补码
//	//一个整数的2进制表示有三种：
//	//原码 
//	//反码
//	//补码
//	 //    负数的计算
//	// -1：
//	//100000000000000000000001（原码）最高位为符号位 1表示负，0表示正
//	//111111111111111111111110(反码)
//	//111111111111111111111111（补码）
//	//对于正整数 ，原码，反码，补码相同
//
//	
//
//	return 0;
//}
//int main()
//{
//	int a = 10;
//	int b = ++a;//前置++，先++,后使用
//	int c = a++;//后置++，先使用，后++
//	printf("%d\n", a);//11
//	printf("%d\n", b);//11
//	printf("%d\n", c);
//	return 0;
//}
//int main()
//{
//	int a =(int) 3.14;//初始化”: 从“double”转换到“int”，可能丢失数据，可以
//	printf("%d\n", a);
//	return 0;
//}
//int main()
//{
//	int a = 1;
//	int b = 2;
//	int d = 0;
//	int c = a && b;//逻辑与，两都为真才为真
//	int e = a || d;//逻辑或，一个为真就为真
//	printf("%d\n", c);
//	printf("%d\n", e);
//	return 0;
// }
//int main()
//{
//	//条件操作符（三目操作符）
//	//exp1?exp2:exp3
//	//exp1成立，整个表达式 的结果是exp2，不成立，结果为exp3；
//	int a = 3;
//	int b = 2;
//	int max = 0;
//	max = a > b ? a : b;
//	printf("max=%d\n", max);
//	return 0;
//}
//int main()
//{
//	  //逗号表达式
//	//（2，4+5，6）;
//	int a = 0;
//	int b = 3;
//	int c = 5;
//	          //a=5     c=1        
//	int d = (a = b + 5, c = a - 4, b = c + 2);
//	//逗号表达式，是从左向右依次计算的
//	//整个表达式的结果是最后一个表达式的结果，相当于把最后b的值赋给d
//	printf("%d\n", d);
//
//	return 0;
//}


